Repository: common-repository/opr-place-reservations
Catalog: languages/orwokki-pr-*.po
Languages: fi

source: OPR Place Reservations
fi: OPR Paikkavaraukset

source: Plugin to handle and show places to rent and their reservations
fi: Lisäosa jolla hallinnoit ja julkaiset vuokrattavia paikkoja ja niiden varauksia

source: Not allowed.
fi: Ei sallittu.

source: Value of name field is too long. Expected maximum of 255 characters, got %d characters.
fi: Nimi kentässä oleva arvo on liian pitkä. Maksimi pituus on 255 merkkiä, nyt pituus on %d merkkiä.

source: Value of email field is too long. Expected maximum of 255 characters, got %d characters.
fi: Sähköpostiosoite kentässä oleva arvo on liian pitkä. Maksimi pituus on 255 merkkiä, nyt pituus on %d merkkiä.

source: Value of phone number field is too long. Expected maximum of 255 characters, got %d characters.
fi: Puhelinnumero kentässä oleva arvo on liian pitkä. Maksimi pituus on 255 merkkiä, nyt pituus on %d merkkiä.

source: Failed to create new reservation.
fi: Uuden varauksen luominen epäonnistui.

source: Failed storing new reservation.
fi: Varauksen tallentaminen epäonnistui.

source: New reservation created successfully.
fi: Varaus onnistui.

source: Failed to remove reservation:
fi: Varauksen poistaminen epäonnistui:

source: Reservation removed successfully.
fi: Varaus poistettu onnistuneesti.

source: Remove
fi: Poista

source: Show more reservations
fi: Näytä lisää varauksia

source: Failed to create new place.
fi: Uuden paikan luominen epäonnistui.

source: Failed storing new place.
fi: Uuden paikan tallentaminen epäonnistui.

source: New place created successfully.
fi: Uusi paikka luotu onnistuneesti.

source: Failed to remove place:
fi: Paikan poistaminen epäonnistui:

source: Place removed successfully.
fi: Paikka poistettu onnistuneesti.

source: Show more places
fi: Näytä lisää paikkoja

source: Failed to add new place-type.
fi: Uuden paikkatyypin lisääminen epäonnistui.

source: New place-type added succesfully
fi: Uusi paikkatyyppi lisätty onnistuneesti

source: Changed place-type succesfully
fi: Paikkatyypin tietoja muokattu onnistuneesti

source: General type
fi: Kohdetyyppi

source: Parking
fi: Parkkipaikka

source: Name of the place-type
fi: Paikkatyypin nimi

source: Activity
fi: Käytettävissä

source: Active
fi: Käytettävissä

source: Not in use
fi: Ei käytettävissä

source: Save
fi: Tallenna

source: Failed to add new location.
fi: Uuden lokaation lisääminen epäonnistui.

source: New location added successfully
fi: Uusi lokaatio lisätty onnistuneesti

source: Changed location succesfully
fi: Lokaatiota muutettu onnistuneesti

source: Name of the location
fi: Lokaation nimi

source: Failed to add new period type.
fi: Uuden kausityypin lisääminen epäonnistui.

source: New period type added successfully
fi: Uusi kausityyppi lisätty onnistuneesti

source: Changed period type successfully
fi: Kausityyppiä muutettu onnistuneesti

source: Name of the period type
fi: Kausityypin nimi

source: Invalid value for "Order places by column".
fi: Tuntematon arvo "Järjestä paikat sarakkeen mukaan" -kentälle.

source: Customer view settings saved successfully
fi: Asiakasnäkymän asetukset tallennettu onnistuneesti

source: Reservation settings saved successfully
fi: Varausten asetukset tallennettu onnistuneesti

source: Email general settings saved successfully
fi: Sähköposti-ilmoitusten yleiset asetukset tallennettu onnistuneesti

source: Customer email content settings saved successfully
fi: Asiakkaalle lähetettävän viestin asetukset tallennettu onnistuneesti

source: Administration email content settings saved successfully
fi: Hallinnolle lähetettävän viestin asetukset tallennettu onnistuneesti

source: Are you sure you want to remove this reservation?
fi: Oletko varma, että haluat poistaa tämän varauksen?

source: Are you sure you want to remove this place and all reservations related to it?
fi: Oletko varma, että haluat poistaa tämän paikan ja siihen liittyvät varaukset?

source: Import failed: %s
fi: Tuonti epäonnistui: %s

source: Uploading import-file failed.
fi: Tuontitiedoston lataus epäonnistui.

source: Reservations
fi: Varaukset

source: Add new reservation
fi: Lisää uusi varaus

source: List of reservations
fi: Varauslista

source: Places
fi: Paikat

source: Add new place
fi: Lisää uusi paikka

source: List of places
fi: Paikkalistaus

source: Types & locations
fi: Tyypit ja lokaatiot

source: Settings
fi: Asetukset

source: Customer view settings
fi: Asiakasnäkymän asetukset

source: Data import
fi: Tietojen tuonti

source: Import reservations with their places
fi: Tuo varauksia ja niiden paikat

source: Example CSV file
fi: Esimerkki CSV-tiedosto

source: Import reservations
fi: Tuo varauksia

source: Import places
fi: Tuo paikkoja

source: Select which fields are shown at customer view
fi: Valitse mitkä kentät näytetään asiakasnäkymässä

source: When selected %s is shown at customer view
fi: Kun valittuna %s näytetään asiakasnäkymässä

source: Place type
fi: Paikkatyyppi

source: Location
fi: Lokaatio

source: Period type
fi: Kausityyppi

source: Length
fi: Pituus

source: Width
fi: Leveys

source: Depth
fi: Syvyys

source: Description
fi: Kuvaus

source: Order places by column
fi: Tieto jonka mukaan paikat järjestetään

source: Place name
fi: Paikkatunnus

source: Reservation settings
fi: Varausten asetukset

source: Select reservation fields which are mandatory to fill
fi: Varauksen pakolliset tiedot

source: Place
fi: Paikka

source: When selected it is mandatory to fill field %s when making reservation
fi: Valittuna tieto %s on pakko antaa varausta tehtäessä

source: Name
fi: Nimi

source: Email
fi: Sähköpostiosoite

source: Phone number
fi: Puhelinnumero

source: Reservation start time
fi: Varauksen alkamisaika

source: Reservation end time
fi: Varauksen päättymisaika

source: Additional information
fi: Lisätiedot

source: General email settings
fi: Yleiset sähköposti-ilmoitusten asetukset

source: Admin notification receiver email
fi: Hallinnon sähköpostiosoite

source: Email address where notifications are sent
fi: Sähköpostiosoite johon ilmoitukset lähetetään

source: Reservation email content for customer
fi: Varauksen sähköposti-ilmoituksen sisältö asiakkaalle

source: Following data replacements can be used in the subject and content of the email. Data replacements are going to be replaced with actual values when sending the email. Remember to include the "{" and "}" characters.
fi: Seuraavia tageja voidaan käyttää sähköpostin sisällössä ja otsikossa. Tagit muutetaan oikeaksi arvoiksi ennen sähköpostin lähettämistä. Muista lisätä "{" ja "}" merkit muuttujien nimien ympärille.

source: Email subject
fi: Sähköpostin aihe

source: Subject of the email sent to customer about the reservation
fi: Asiakkaalle lähetettävän sähköpostin aihe

source: Email content
fi: Sähköpostin sisältö

source: Content of the email sent to customer about the reservation
fi: Asiakkaalle lähetettävän sähköpostin sisältö

source: Reservation email content for administration
fi: Varauksen sähköposti-ilmoituksen sisältö hallinnolle

source: Subject of the email sent to administration about the reservation
fi: Hallinnolle lähetettävän sähköpostin aihe

source: Content of the email sent to administration about the reservation
fi: Hallinnolle lähetettävän sähköpostin sisältö

source: Add
fi: Lisää

source: Actions
fi: Toiminnot

source: Name of the place
fi: Paikkatunnus

source: Filter
fi: Suodata

source: Place types
fi: Paikkatyypit

source: Add place type
fi: Lisää paikkatyyppi

source: Locations
fi: Lokaatiot

source: Add location
fi: Lisää lokaatio

source: Period types
fi: Kausityypit

source: Add period type
fi: Lisää kausityyppi

source: CSV file that contains reservations and their places to be imported into the system
fi: CSV-tiedosto joka sisältää tuotavien paikkojen ja niiden varauksien tietoja

source: CSV import file
fi: Tuotava CSV-tiedosto

source: If imported place already exists and has existing reservations remove the reservations
fi: Jos tuotava paikka on jo olemassa ja sille on olemassa varaus niin poista tämä varaus jotta paikan tietoja voidaan muuttaa

source: Remove existing reservation from place
fi: Poista olemassa oleva varaus

source: If imported place has types and locations defined that does not exist create them
fi: Jos tuotavaan paikkaan liittyy tyyppejä ja/tai lokaatioita, joita ei ole olemassa niin luo ne

source: Create types and locations
fi: Luo tyypit ja lokaatiot

source: Change data of existing places found by place name
fi: Muuta nimen perusteella löydetyn olemassa olevan paikan tiedot

source: Change data of existing places
fi: Muuta olemassa olevien paikkojen tiedot

source: Import
fi: Tuo

source: Import the contents of the selected file
fi: Tuo valitun tiedoston sisältö

source: CSV file that contains reservations to be imported into the system
fi: CSV-tiedosto joka sisältää tuotavia varauksia ja niiden tietoja

source: If duplicate reservation is found remove the existing reservation
fi: Jos duplikaatteja varauksia löytyy niin poista olemassa oleva varaus

source: Remove existing reservation
fi: Poista olemassa oleva varaus

source: CSV file that contains places to be imported into the system
fi: CSV-tiedosto joka sisältää tuotavia paikkoja ja niiden tietoja

source: If imported place already exists and has existing reservations remove the reservations, this is needed to change the place in case reservations were found
fi: Jos tuotava paikka on jo olemassa ja sille on olemassa varaus niin poista tämä varaus jotta paikan tietoja voidaan muuttaa

source: Remove existing reservation from place to be changed
fi: Poista muutettavan paikan olemassa oleva varaus

source: If imported place has types and locations defined that does not exist then create them
fi: Jos tuotavaan paikkaan liittyy tyyppejä ja/tai lokaatioita, joita ei ole olemassa niin luo ne

source: Insufficient permissions.
fi: Riittämättömät oikeudet.

source: Place '%s' already has existing reservation.
fi: Paikalle '%s' on jo olemassa varaus.

source: Place type with name '%s' could not be found.
fi: Paikkatyyppiä nimeltään '%s' ei löydy.

source: Period type with name '%s' could not be found.
fi: Kausityyppiä nimeltään '%s' ei löydy.

source: Location with name '%s' could not be found.
fi: Lokaatiota nimeltään '%s' ei löydy.

source: Uploaded file %s does not exist
fi: Ladattua tiedostoa %s ei löydy

source: Could not open uploaded file %s for reading
fi: Ladatun tiedoston %s lukeminen epäonnistui

source: Importing row #%d with place name '%s' failed: %s
fi: Tuonnissa tapahtui virhe tiedoston rivillä #%d paikan nimenä '%s'. Virheilmoitus: %s

source: Place '%s' has existing reservation it cannot be changed.
fi: Paikalle '%s' on olemassa varaus joten paikan tietoja ei voida muuttaa.

source: Place '%s' already exists
fi: Paikka nimellä '%s' on jo olemassa

source: Importing row #%d with reservation name '%s' failed: %s
fi: Tuonnissa tapahtui virhe tiedoston rivillä #%d varauksen nimenä '%s'. Virheilmoitus: %s

source: Could not find place with name '%s'.
fi: Paikkaa nimellä '%s' ei löytynyt.

source: Invalid location ID '%d' given
fi: Annettu lokaation tunniste '%d' on virheellinen

source: Invalid location name '%s' given
fi: Annettu lokaation nimi '%s' on virheellinen

source: Place with name '%s' already exists.
fi: Paikka nimellä '%s' on jo olemassa.

source: Invalid place ID '%d' given
fi: Virheellinen paikan tunniste '%d' annettu

source: Could not find place with ID '%d'
fi: Paikkaa tunnisteella '%d' ei löytynyt

source: Invalid place name '%s' given
fi: Virheellinen paikan nimi '%s' annettu

source: Importer
fi: Tietojen tuonti

source: Reservations Administrator
fi: Varausten ylläpitäjä

source: Reservations Places Administrator
fi: Paikkojen ylläpitäjä

source: Reservations Global Administrator
fi: Varausjärjestelmän ylläpitäjä

source: Invalid period type ID '%d' given
fi: Annettu kausityypin tunniste '%d' on virheellinen

source: Invalid period type name '%s' given
fi: Annettu kausityypin nimi '%s' on virheellinen

source: Invalid reservation ID '%d' given
fi: Annettu varauksen tunniste '%d' on virheellinen

source: Could not find reservation with ID '%d'
fi: Varausta tunnisteella '%d' ei löytynyt

source: There are mandatory fields without value. Field(s): %s
fi: Varauksesta puuttuu seuraavat pakolliset tiedot: %s

source: Reserve
fi: Varaa

source: Make reservation
fi: Tee varaus
